reversing/challenge2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Challenge 2</title>
<meta property="og:title" content="Challenge 2" />
<meta name="author" content="8dcc" />
<meta name="generator" content="Org Mode" />
<link rel="icon" type="image/x-icon" href="../img/favicon.png" />
<link rel="stylesheet" type="text/css" href="../css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
  <a accesskey="u" href="index.html">Up</a> | <a accesskey="h" href="../index.html">Home</a>
</div><div id="content" class="content">
<h1 class="title">Challenge 2</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#original-assembly">1. Original assembly</a></li>
<li><a href="#analysis">2. Analysis</a></li>
<li><a href="#c-translation">3. C translation</a></li>
<li><a href="#inverse-function">4. Inverse function</a></li>
</ul>
</div>
</div>

<div id="outline-container-original-assembly" class="outline-2">
<h2 id="original-assembly"><span class="section-number-2">1.</span> Original assembly</h2>
<div class="outline-text-2" id="text-original-assembly">
<p>
Original challenge link: <a href="https://challenges.re/2/">Click me</a>.
</p>

<p>
This is the original assembly code from the challenge, I just formatted it a
bit to fit the <a href="https://www.nasm.us/">nasm</a> syntax.
</p>

<div class="org-src-container">
<pre class="src src-nasm"><span style="color: #3f578f;">func</span>:
    <span style="color: #721045;">mov</span>    <span style="color: #005f5f;">eax</span>, [<span style="color: #005f5f;">esp</span> + <span style="color: #2a5045;">0x4</span>]
    <span style="color: #721045;">bswap</span>  <span style="color: #005f5f;">eax</span>
    <span style="color: #721045;">mov</span>    <span style="color: #005f5f;">edx</span>, <span style="color: #005f5f;">eax</span>
    <span style="color: #721045;">and</span>    <span style="color: #005f5f;">eax</span>, <span style="color: #2a5045;">0x0F0F0F0F</span>
    <span style="color: #721045;">and</span>    <span style="color: #005f5f;">edx</span>, <span style="color: #2a5045;">0xF0F0F0F0</span>
    <span style="color: #721045;">shr</span>    <span style="color: #005f5f;">edx</span>, <span style="color: #2a5045;">4</span>
    <span style="color: #721045;">shl</span>    <span style="color: #005f5f;">eax</span>, <span style="color: #2a5045;">4</span>
    <span style="color: #721045;">or</span>     <span style="color: #005f5f;">eax</span>, <span style="color: #005f5f;">edx</span>
    <span style="color: #721045;">mov</span>    <span style="color: #005f5f;">edx</span>, <span style="color: #005f5f;">eax</span>
    <span style="color: #721045;">and</span>    <span style="color: #005f5f;">eax</span>, <span style="color: #2a5045;">0x33333333</span>
    <span style="color: #721045;">and</span>    <span style="color: #005f5f;">edx</span>, <span style="color: #2a5045;">0xCCCCCCCC</span>
    <span style="color: #721045;">shr</span>    <span style="color: #005f5f;">edx</span>, <span style="color: #2a5045;">2</span>
    <span style="color: #721045;">shl</span>    <span style="color: #005f5f;">eax</span>, <span style="color: #2a5045;">2</span>
    <span style="color: #721045;">or</span>     <span style="color: #005f5f;">eax</span>, <span style="color: #005f5f;">edx</span>
    <span style="color: #721045;">mov</span>    <span style="color: #005f5f;">edx</span>, <span style="color: #005f5f;">eax</span>
    <span style="color: #721045;">and</span>    <span style="color: #005f5f;">eax</span>, <span style="color: #2a5045;">0x55555555</span>
    <span style="color: #721045;">and</span>    <span style="color: #005f5f;">edx</span>, <span style="color: #2a5045;">0xAAAAAAAA</span>
    <span style="color: #721045;">add</span>    <span style="color: #005f5f;">eax</span>, <span style="color: #005f5f;">eax</span>
    <span style="color: #721045;">shr</span>    <span style="color: #005f5f;">edx</span>, <span style="color: #2a5045;">1</span>
    <span style="color: #721045;">or</span>     <span style="color: #005f5f;">eax</span>, <span style="color: #005f5f;">edx</span>
    <span style="color: #721045;">ret</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-analysis" class="outline-2">
<h2 id="analysis"><span class="section-number-2">2.</span> Analysis</h2>
<div class="outline-text-2" id="text-analysis">
<p>
Let&rsquo;s try to figure this out step by step.
</p>

<p>
First of all, it loads the function argument into <code>eax</code>. Since this program was
compiled with <code>-m32</code>, it follows the <a href="https://www.sco.com/developers/devspecs/abi386-4.pdf">i386 System V ABI</a>.
</p>

<blockquote>
<p>
<b>i386 System V ABI - Registers and the Stack Frame (Page 37)</b>
</p>

<p>
Argument words are pushed onto the stack in reverse order (that is, the
rightmost argument in C call syntax has the highest address), preserving the
stack&rsquo;s word alignment. All incoming arguments appear on the stack, residing in
the stack frame of the caller.
</p>
</blockquote>

<p>
The caller, after pushing the function parameters, pushes the return address to
the stack with the <code>call</code> instruction, taking up 4 bytes. We can add these 4 bytes
to the <code>esp</code> register to skip over the return address and get the parameters.
</p>

<div class="org-src-container">
<pre class="src src-nasm"><span style="color: #721045;">mov</span>     <span style="color: #005f5f;">eax</span>, [<span style="color: #005f5f;">esp</span> + <span style="color: #2a5045;">0x4</span>]
</pre>
</div>

<p>
Note that we are <b>not</b> using the <code>ebp</code> register to preserve the stack frame. If the
function started like this, we would also have to &ldquo;skip&rdquo; over the pushed <code>ebp</code> to
access the parameters:
</p>

<div class="org-src-container">
<pre class="src src-nasm"><span style="color: #3f578f;">func</span>:
    <span style="color: #721045;">push</span>    <span style="color: #005f5f;">ebp</span>                 <span style="color: #595959;">; </span><span style="color: #595959;">Preserve caller's stack frame (pushing another 4 bytes)</span>
    <span style="color: #721045;">mov</span>     <span style="color: #005f5f;">ebp</span>, <span style="color: #005f5f;">esp</span>            <span style="color: #595959;">; </span><span style="color: #595959;">Store current stack frame</span>
    <span style="color: #721045;">mov</span>     <span style="color: #005f5f;">eax</span>, [<span style="color: #005f5f;">esp</span> + <span style="color: #2a5045;">0x8</span>]    <span style="color: #595959;">; </span><span style="color: #595959;">Skip over pushed EBP and the return address (4 + 4)</span>
    ...
    <span style="color: #721045;">mov</span>     <span style="color: #005f5f;">esp</span>, <span style="color: #005f5f;">ebp</span>            <span style="color: #595959;">; </span><span style="color: #595959;">Restore stack frame</span>
    <span style="color: #721045;">pop</span>     <span style="color: #005f5f;">ebp</span>                 <span style="color: #595959;">; </span><span style="color: #595959;">Pop caller's stack frame</span>
    <span style="color: #721045;">ret</span>                         <span style="color: #595959;">; </span><span style="color: #595959;">Next value on the stack is the return address, popped by `ret`</span>
</pre>
</div>

<p>
Next, it uses <code>bswap</code> to reverse the bytes (not bits) in the <code>eax</code> register. From
<a href="https://www.felixcloutier.com/x86/bswap">felixcloutier.com</a>:
</p>

<blockquote>
<p>
<b>BSWAP — Byte Swap</b>
</p>

<p>
Reverses the byte order of a 32-bit [&#x2026;] register. This instruction is provided
for converting little-endian values to big-endian format and vice versa.
</p>
</blockquote>

<p>
So it will convert <code>0x11223344</code> to <code>0x44332211</code>.
</p>

<div class="org-src-container">
<pre class="src src-nasm"><span style="color: #721045;">bswap</span>   <span style="color: #005f5f;">eax</span>
</pre>
</div>

<p>
Next, it copies <code>eax</code> to <code>edx</code>, and masks <code>eax</code> with <code>0x0f0f0f0f</code> and <code>edx</code> with
<code>0xf0f0f0f0</code>. This will store the higher half of the bytes inside <code>eax</code>, and the
lower part in <code>edx</code>.
</p>

<div class="org-src-container">
<pre class="src src-nasm"><span style="color: #721045;">mov</span>     <span style="color: #005f5f;">edx</span>, <span style="color: #005f5f;">eax</span>
<span style="color: #721045;">and</span>     <span style="color: #005f5f;">eax</span>, <span style="color: #2a5045;">0x0F0F0F0F</span>
<span style="color: #721045;">and</span>     <span style="color: #005f5f;">edx</span>, <span style="color: #2a5045;">0xF0F0F0F0</span>
</pre>
</div>

<p>
After that, it shifts <code>eax</code> 4 bits to the left, <code>edx</code> 4 bits to the right, and OR&rsquo;s
them back together.
</p>

<div class="org-src-container">
<pre class="src src-nasm"><span style="color: #721045;">shr</span>     <span style="color: #005f5f;">edx</span>, <span style="color: #2a5045;">4</span>
<span style="color: #721045;">shl</span>     <span style="color: #005f5f;">eax</span>, <span style="color: #2a5045;">4</span>
<span style="color: #721045;">or</span>      <span style="color: #005f5f;">eax</span>, <span style="color: #005f5f;">edx</span>
</pre>
</div>

<p>
Let&rsquo;s try to visualize these last steps with an example:
</p>

<pre class="example" id="example1">
Base number:    0xDEADBEEF  0b11011110101011011011111011101111

After masking:  0x0E0D0E0F  0b00001110000011010000111000001111 (eax)
                0xD0A0B0E0  0b11010000101000001011000011100000 (edx)

After shifting: 0xE0D0E0F0  0b11100000110100001110000011110000 (eax)
                0x0D0A0B0E  0b00001101000010100000101100001110 (edx)

After merging:  0xEDDAEBFE  0b11101101110110101110101111111110
</pre>

<p>
As you can see, every <a href="https://en.wikipedia.org/wiki/Nibble">nibble</a> (group of 4 bits) has been swapped with the
adjacent one.
</p>

<p>
Right after that, we copy the result back to <code>edx</code>, and we do a similar
operation. In this case, however, we will be swapping <b>bit pairs</b>, instead of
nibbles:
</p>

<div class="org-src-container">
<pre class="src src-nasm"><span style="color: #721045;">mov</span>     <span style="color: #005f5f;">edx</span>, <span style="color: #005f5f;">eax</span>
<span style="color: #721045;">and</span>     <span style="color: #005f5f;">eax</span>, <span style="color: #2a5045;">0x33333333</span>   <span style="color: #595959;">; </span><span style="color: #595959;">0b00110011001100110011001100110011</span>
<span style="color: #721045;">and</span>     <span style="color: #005f5f;">edx</span>, <span style="color: #2a5045;">0xCCCCCCCC</span>   <span style="color: #595959;">; </span><span style="color: #595959;">0b11001100110011001100110011001100</span>
<span style="color: #721045;">shr</span>     <span style="color: #005f5f;">edx</span>, <span style="color: #2a5045;">2</span>
<span style="color: #721045;">shl</span>     <span style="color: #005f5f;">eax</span>, <span style="color: #2a5045;">2</span>
<span style="color: #721045;">or</span>      <span style="color: #005f5f;">eax</span>, <span style="color: #005f5f;">edx</span>
</pre>
</div>

<p>
Bits 0 and 1 have been swapped with bits 2 and 3, bits 4 and 5 have been swapped
with bits 6 and 7, etc.
</p>

<p>
And finally, it does a similar operation with <b>every bit</b>:
</p>

<div class="org-src-container">
<pre class="src src-nasm"><span style="color: #721045;">mov</span>    <span style="color: #005f5f;">edx</span>, <span style="color: #005f5f;">eax</span>
<span style="color: #721045;">and</span>    <span style="color: #005f5f;">eax</span>, <span style="color: #2a5045;">0x55555555</span>   <span style="color: #595959;">; </span><span style="color: #595959;">0b01010101010101010101010101010101</span>
<span style="color: #721045;">and</span>    <span style="color: #005f5f;">edx</span>, <span style="color: #2a5045;">0xAAAAAAAA</span>   <span style="color: #595959;">; </span><span style="color: #595959;">0b10101010101010101010101010101010</span>
<span style="color: #721045;">add</span>    <span style="color: #005f5f;">eax</span>, <span style="color: #005f5f;">eax</span>
<span style="color: #721045;">shr</span>    <span style="color: #005f5f;">edx</span>, <span style="color: #2a5045;">1</span>
<span style="color: #721045;">or</span>     <span style="color: #005f5f;">eax</span>, <span style="color: #005f5f;">edx</span>
<span style="color: #721045;">ret</span>
</pre>
</div>

<p>
Note that adding a number to itself (multiplying by two) is the same as shifting
to the left. The previous code could have been written as:
</p>

<div class="org-src-container">
<pre class="src src-nasm">...
<span style="color: #721045;">and</span>    <span style="color: #005f5f;">eax</span>, <span style="color: #2a5045;">0x55555555</span>
<span style="color: #721045;">and</span>    <span style="color: #005f5f;">edx</span>, <span style="color: #2a5045;">0xAAAAAAAA</span>
<span style="color: #721045;">shl</span>    <span style="color: #005f5f;">eax</span>, <span style="color: #2a5045;">1</span>
<span style="color: #721045;">shr</span>    <span style="color: #005f5f;">edx</span>, <span style="color: #2a5045;">1</span>
...
</pre>
</div>

<p>
Which matches the previous operations.
</p>

<p>
The final OR&rsquo;d result will be saved to <code>eax</code> and returned.
</p>
</div>
</div>

<div id="outline-container-c-translation" class="outline-2">
<h2 id="c-translation"><span class="section-number-2">3.</span> C translation</h2>
<div class="outline-text-2" id="text-c-translation">
<p>
This is a simple C translation of the assembly:
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #a0132f;">#include</span> <span style="color: #005e8b;">&lt;stdint.h&gt;</span>
<span style="color: #a0132f;">#include</span> <span style="color: #005e8b;">&lt;byteswap.h&gt;</span>
<span style="color: #a0132f;">#include</span> <span style="color: #005e8b;">&lt;stdio.h&gt;</span>

<span style="color: #0031a9;">uint32_t</span> <span style="color: #3f578f;">swap</span>(<span style="color: #0031a9;">uint32_t</span> <span style="color: #005f5f;">num</span>) {
    num = bswap_32(num);
    num = ((num &amp; <span style="color: #2a5045;">0x0F0F0F0F</span>) &lt;&lt; <span style="color: #2a5045;">4</span>) | ((num &amp; <span style="color: #2a5045;">0xF0F0F0F0</span>) &gt;&gt; <span style="color: #2a5045;">4</span>);
    num = ((num &amp; <span style="color: #2a5045;">0x33333333</span>) &lt;&lt; <span style="color: #2a5045;">2</span>) | ((num &amp; <span style="color: #2a5045;">0xCCCCCCCC</span>) &gt;&gt; <span style="color: #2a5045;">2</span>);
    num = ((num &amp; <span style="color: #2a5045;">0x55555555</span>) &lt;&lt; <span style="color: #2a5045;">1</span>) | ((num &amp; <span style="color: #2a5045;">0xAAAAAAAA</span>) &gt;&gt; <span style="color: #2a5045;">1</span>);
    <span style="color: #972500;">return</span> num;
}

<span style="color: #a0132f;">#define</span> <span style="color: #3f578f;">PRINT_EXPR</span>(<span style="color: #005f5f;">E</span>) printf(<span style="color: #005e8b;">"</span><span style="color: #972500;">%s</span><span style="color: #005e8b;"> 0x</span><span style="color: #972500;">%X\n</span><span style="color: #005e8b;">"</span>, #E, E)

<span style="color: #0031a9;">int</span> <span style="color: #3f578f;">main</span>(<span style="color: #0031a9;">void</span>) {
    PRINT_EXPR(swap(<span style="color: #2a5045;">0xDEADBEEF</span>));       <span style="color: #595959;">/* </span><span style="color: #595959;">0xF77DB57B</span><span style="color: #595959;"> */</span>
    PRINT_EXPR(swap(swap(<span style="color: #2a5045;">0xDEADBEEF</span>))); <span style="color: #595959;">/* </span><span style="color: #595959;">0xDEADBEEF</span><span style="color: #595959;"> */</span>
    <span style="color: #972500;">return</span> <span style="color: #2a5045;">0</span>;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-inverse-function" class="outline-2">
<h2 id="inverse-function"><span class="section-number-2">4.</span> Inverse function</h2>
<div class="outline-text-2" id="text-inverse-function">
<p>
I made my own inverse function before realizing that the original swapping
function is actually an <a href="https://en.wikipedia.org/wiki/Involution_(mathematics)">involutory function</a>, so using it on its own output
produces the original input.
</p>

<p>
The bit swapping sections are the same, just in a different order.
</p>

<div class="org-src-container">
<pre class="src src-nasm"><span style="color: #3f578f;">inverse</span>:
    <span style="color: #721045;">mov</span>    <span style="color: #005f5f;">eax</span>, [<span style="color: #005f5f;">esp</span> + <span style="color: #2a5045;">0x4</span>]

    <span style="color: #721045;">mov</span>    <span style="color: #005f5f;">edx</span>, <span style="color: #005f5f;">eax</span>
    <span style="color: #721045;">and</span>    <span style="color: #005f5f;">eax</span>, <span style="color: #2a5045;">0x55555555</span>
    <span style="color: #721045;">and</span>    <span style="color: #005f5f;">edx</span>, <span style="color: #2a5045;">0xAAAAAAAA</span>
    <span style="color: #721045;">shl</span>    <span style="color: #005f5f;">eax</span>, <span style="color: #2a5045;">1</span>
    <span style="color: #721045;">shr</span>    <span style="color: #005f5f;">edx</span>, <span style="color: #2a5045;">1</span>
    <span style="color: #721045;">or</span>     <span style="color: #005f5f;">eax</span>, <span style="color: #005f5f;">edx</span>

    <span style="color: #721045;">mov</span>    <span style="color: #005f5f;">edx</span>, <span style="color: #005f5f;">eax</span>
    <span style="color: #721045;">and</span>    <span style="color: #005f5f;">eax</span>, <span style="color: #2a5045;">0x33333333</span>
    <span style="color: #721045;">and</span>    <span style="color: #005f5f;">edx</span>, <span style="color: #2a5045;">0xCCCCCCCC</span>
    <span style="color: #721045;">shl</span>    <span style="color: #005f5f;">eax</span>, <span style="color: #2a5045;">2</span>
    <span style="color: #721045;">shr</span>    <span style="color: #005f5f;">edx</span>, <span style="color: #2a5045;">2</span>
    <span style="color: #721045;">or</span>     <span style="color: #005f5f;">eax</span>, <span style="color: #005f5f;">edx</span>

    <span style="color: #721045;">mov</span>    <span style="color: #005f5f;">edx</span>, <span style="color: #005f5f;">eax</span>
    <span style="color: #721045;">and</span>    <span style="color: #005f5f;">eax</span>, <span style="color: #2a5045;">0x0F0F0F0F</span>
    <span style="color: #721045;">and</span>    <span style="color: #005f5f;">edx</span>, <span style="color: #2a5045;">0xF0F0F0F0</span>
    <span style="color: #721045;">shl</span>    <span style="color: #005f5f;">eax</span>, <span style="color: #2a5045;">4</span>
    <span style="color: #721045;">shr</span>    <span style="color: #005f5f;">edx</span>, <span style="color: #2a5045;">4</span>
    <span style="color: #721045;">or</span>     <span style="color: #005f5f;">eax</span>, <span style="color: #005f5f;">edx</span>

    <span style="color: #721045;">bswap</span>  <span style="color: #005f5f;">eax</span>
    <span style="color: #721045;">ret</span>
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
